"""
В этом файле прописываются пользовательские конверторы
"""


class FourDigitYearConverter:
    regex = "[0-9]{4}"

    def to_python(self, value: str) -> int:
        try:
            return int(value)
        except ValueError:
            return 0

    def to_url(self, value: int) -> str:
        """
        он принимает значение (год) и форматирует его обратно в 4-значную строку для подстановки в URL
        % (посередине) — оператор форматирования: подставляет значение справа в шаблон слева.
        "%04d" — строка формата:
        % — маркер подстановки.
        d — десятичное целое число (decimal).
        4 — минимальная длина итоговой строки (ровно 4 символа).
        0 — если в числе меньше 4 цифр, дополнить недостающие места ведущими нулями слева.
        :param value:
        :return:
        """
        return "%04d" % int(value) # старый стиль
        # return f"{int(value):04d}" # современный стиль